app/views/users/profile.html.erb

SELECT "artworks".* FROM "artworks" INNER JOIN "favorites" ON "artworks"."id" = "favorites"."artwork_id" WHERE "favorites"."user_id" = ?  [["user_id", 2]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <h3 class="mt-3">Artwork History:</h3>
            <% if @user.artworks_history.present? %>
              <ul>
                <% @user.artworks_history.each do |artwork_id| %>
                <% artwork = Artwork.find_by(id: artwork_id) %>