app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 631], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "artworks" INNER JOIN "favorites" ON "artworks"."id" = "favorites"."artwork_id" WHERE "favorites"."user_id" = ? AND "artworks"."id" = ? LIMIT ?  [["user_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def show
    @artwork = Artwork.find_by(id: params[:id])
    unless @artwork
      redirect_to root_path, alert: 'No artwork found with that artwork ID.'
    end

    if current_user
      @is_favorited = current_user.favorited_artworks.include?(@artwork)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def favorite
    artwork = Artwork.find(params[:id])

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def unfavorite
    artwork = Artwork.find(params[:id])