app/controllers/image_search_controller.rb

  def search
    if params[:file].present?
      base64_image = convert_to_base64(params[:file])
      artwork_id = get_artwork_id_from_api(base64_image)
      # Simulate artwork identification by fetching a pre-stored artwork
      # @artwork = Artwork.find_by(id: params[:id])

      # only for test purpose, need to update once image recognition is implemented
      if params[:file].original_filename == 'no_match_image.jpeg'
        @artwork = nil
      else
        #fetch default artwork
        @artwork = Artwork.find_by(id: artwork_id)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 69], ["LIMIT", 1]]

  def update_artworks_history(user, artwork_id)
    # Assuming artwork_history is an array of artwork IDs
    user.artworks_history = [] unless user.artworks_history
    user.artworks_history.push(artwork_id)
    user.save
---
UPDATE "users" SET "artworks_history" = ? WHERE "users"."id" = ?  [["artworks_history", "---\n- 1\n"], ["id", 4]]
UPDATE "users" SET "artworks_history" = ? WHERE "users"."id" = ?  [["artworks_history", "---\n- 1\n- 1\n- 69\n"], ["id", 1]]