app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "artworks_history") VALUES (?, ?, ?, ?) RETURNING "id"  [["username", "sc"], ["email", "sc@qq.com"], ["password_digest", "[FILTERED]"], ["artworks_history", nil]]

  def show #login in successfully
    @user ||= User.find_by(id: session[:user_id])
    #@random_artworks = Artwork.order(Arel.sql('RANDOM()')).limit(10)
    @random_artworks = Artwork.order(Arel.sql('RANDOM()')).distinct(:some_unique_attribute).limit(10)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "artworks"."id" FROM "artworks"

  def edit
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find(session[:user_id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["id", 4]]

  def profile
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]