app/models/user.rb

INSERT INTO "favorites" ("user_id", "artwork_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["artwork_id", 7], ["created_at", "2023-11-29 21:21:49.358919"], ["updated_at", "2023-11-29 21:21:49.358919"]]
---
  def add_to_favorites(artwork)
    favorited_artworks << artwork unless favorited_artworks.include?(artwork)

DELETE FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."artwork_id" = ?  [["user_id", 2], ["artwork_id", 6]]
---
  def remove_from_favorites(artwork)
    favorited_artworks.delete(artwork)